Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Заявки.Количество() = 0 Тогда
		Сообщить("В реестре платежей нет заявок.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ФактическиеПлатежи.Записывать = Истина;

	Для Каждого СтрокаЗаявки Из Заявки Цикл

		Если Не ЗначениеЗаполнено(СтрокаЗаявки.Заявка) Тогда
			Сообщить("В табличной части есть строка без заявки.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ДанныеЗаявки = СтрокаЗаявки.Заявка;

		ОбъектЗаявки = СтрокаЗаявки.Заявка.ПолучитьОбъект();

		Если ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена Тогда
			Сообщить("Заявка уже оплачена: " + СтрокаЗаявки.Заявка + ". Строка пропущена.");
			Продолжить;
		КонецЕсли;

		Движение = Движения.КАЗ_ФактическиеПлатежи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Заявка = СтрокаЗаявки.Заявка;
		Движение.Контрагент = СтрокаЗаявки.Контрагент;
		Движение.Сумма = СтрокаЗаявки.Сумма;

		ОбъектЗаявки.Статус = Перечисления.КАЗ_СтатусыЗаявки.Оплачена;
		ОбъектЗаявки.Записать();

	КонецЦикла;

КонецПроцедуры