                   Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Лимиты.Количество() = 0 Тогда
		Сообщить("Не заполнена табличная часть лимитов.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ЛимитыПлатежей.Записывать = Истина;

	Для Каждого СтрокаЛимита Из Лимиты Цикл

		Если Не ЗначениеЗаполнено(СтрокаЛимита.ЦФО) Тогда
			Сообщить("В строке лимитов не заполнен центр финансовой ответственности.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаЛимита.СтатьяПлатежа) Тогда
			Сообщить("В строке лимитов не заполнена статья платежа.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если СтрокаЛимита.Лимит <= 0 Тогда
			Сообщить("Лимит должен быть больше нуля.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Движение = Движения.КАЗ_ЛимитыПлатежей.Добавить();

		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЦФО = СтрокаЛимита.ЦФО;
		Движение.СтатьяПлатежа = СтрокаЛимита.СтатьяПлатежа;
		Движение.Лимит = СтрокаЛимита.Лимит;

	КонецЦикла;

КонецПроцедуры