Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ВладелецЗаполнения = Неопределено;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Владелец", ВладелецЗаполнения);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВладелецЗаполнения) Тогда
		ВладелецЗаполнения = Владелец;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ВладелецЗаполнения) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(Этапы.НомерЭтапа) КАК МаксНомерЭтапа
	|ИЗ
	|	Справочник.КАЗ_ЭтапыМаршрутаСогласования КАК Этапы
	|ГДЕ
	|	Этапы.Владелец = &Владелец
	|	И НЕ Этапы.ПометкаУдаления
	|	И НЕ Этапы.ЭтоГруппа";

	Запрос.УстановитьПараметр("Владелец", ВладелецЗаполнения);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МаксНомерЭтапа) Тогда
		НомерЭтапа = Выборка.МаксНомерЭтапа + 1;
	Иначе
		НомерЭтапа = 1;
	КонецЕсли;

КонецПроцедуры
