Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Касса) Тогда
		Сообщить("Не выбрана касса.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сумма <= 0 Тогда
		Сообщить("Сумма ПКО должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ФактическиеПлатежи.Записывать = Истина;
	ДвижениеПлатеж = Движения.КАЗ_ФактическиеПлатежи.Добавить();
	ДвижениеПлатеж.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПлатеж.Период = Дата;
	ДвижениеПлатеж.Контрагент = Контрагент;
	ДвижениеПлатеж.Сумма = Сумма;

	Движения.КАЗ_ОстаткиСчетовИКасс.Записывать = Истина;
	ДвижениеКасса = Движения.КАЗ_ОстаткиСчетовИКасс.Добавить();
	ДвижениеКасса.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеКасса.Период = Дата;
	ДвижениеКасса.СчетКасса = Касса;
	ДвижениеКасса.Сумма = Сумма;

КонецПроцедуры
