     &НаКлиенте
Процедура ТоварыУслугиКоличествоПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТоварыУслуги.ТекущиеДанные;

	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	КонецЕсли;

	ПересчитатьИтог();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугиЦенаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТоварыУслуги.ТекущиеДанные;

	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	КонецЕсли;

	ПересчитатьИтог();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтог()

	Итого = 0;

	Для Каждого СтрокаТЧ Из Объект.ТоварыУслуги Цикл
		Итого = Итого + СтрокаТЧ.Сумма;
	КонецЦикла;

	Объект.СуммаДокумента = Итого;

КонецПроцедуры

