&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отчет.КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроек(Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных")));
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(
		Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	СхемаКомпоновки = Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Отчет.КомпоновщикНастроек.ПолучитьНастройки());

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);

	Результат.Очистить();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

&НаКлиенте
Процедура ПечатнаяФорма(Команда)

	ПечатнаяФормаТабДок = СформироватьПечатнуюФормуНаСервере();
	ПечатнаяФормаТабДок.Показать("Остатки денежных средств");

КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()

	Возврат КазначействоПечатныеФормы.СформироватьПечатнуюФорму("Остатки денежных средств", Результат);

КонецФункции
