Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Платежи.Количество() = 0 Тогда
		Сообщить("Не заполнена табличная часть платежей.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаПлатежа Из Платежи Цикл

		Если Не ЗначениеЗаполнено(СтрокаПлатежа.Заявка) Тогда
			Сообщить("В строке плана не выбрана заявка.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если СтрокаПлатежа.Сумма <= 0 Тогда
			Сообщить("Сумма платежа в плане должна быть больше нуля.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры